app/Controllers/Client/AppointmentController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $appointments = $this->appointmentModel
                            ->select('appointments.*, users.first_name as therapist_first_name, users.last_name as therapist_last_name')
                            ->join('therapists', 'therapists.id = appointments.therapist_id', 'left')
                            ->join('users', 'users.id = therapists.user_id', 'left')
                            ->where('appointments.client_id', $userId)
                            ->orderBy('scheduled_at', 'DESC')
                            ->findAll();
---
SELECT `appointments`.*, `users`.`first_name` as `therapist_first_name`, `users`.`last_name` as `therapist_last_name`
FROM `appointments`
LEFT JOIN `therapists` ON `therapists`.`id` = `appointments`.`therapist_id`
LEFT JOIN `users` ON `users`.`id` = `therapists`.`user_id`
WHERE `appointments`.`client_id` = '9'
ORDER BY `scheduled_at` DESC