app/Controllers/Client/DashboardController.php

    public function index()
    {
        $userId = session()->get('user_id');

        $data = [
            'title' => 'Dashboard Klien',
            'user'  => session()->get(),
            'upcomingAppointments' => $this->appointmentModel->where('client_id', $userId)->where('status', 'scheduled')->orderBy('scheduled_at', 'ASC')->findAll(2), // Get 2 upcoming appointments
            'recentActivities' => $this->activityLogModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll(5), // Get 5 recent activities
            'activePackage' => $this->transactionModel->where('user_id', $userId)->where('status', 'completed')->orderBy('transaction_date', 'DESC')->first(),
---
SELECT *
FROM `appointments`
WHERE `client_id` = '9'
AND `status` = 'scheduled'
ORDER BY `scheduled_at` ASC
 LIMIT 2
SELECT *
FROM `activity_logs`
WHERE `user_id` = '9'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `transactions`
WHERE `user_id` = '9'
AND `status` = 'completed'
ORDER BY `transaction_date` DESC
 LIMIT 1