app/Controllers/Client/PackageController.php

    public function index()
    {
        $testimonials = $this->platformReviewModel->getReviewsWithUserDetails(3); // Mengambil 3 ulasan terbaru dengan detail pengguna

        $processedTestimonials = [];
        foreach ($testimonials as $testimonial) {
            $userName = trim(($testimonial['first_name'] ?? '') . ' ' . ($testimonial['last_name'] ?? ''));
            if (empty($userName)) {
                $userName = 'Pengguna Anonim';
            }
            $userInitials = strtoupper(substr($testimonial['first_name'] ?? 'P', 0, 1) . substr($testimonial['last_name'] ?? 'A', 0, 1));

            $processedTestimonials[] = [
                'user_name'    => $userName,
                'user_initials'=> $userInitials,
                'rating'       => $testimonial['rating'] ?? 0,
                'comment'      => $testimonial['comment'],
                'profile_picture' => $testimonial['profile_picture'] ?? null,
            ];
        }

        $data = [
            'title' => 'Daftar Paket Konsultasi',
            'packages' => $this->packageModel->where('is_active', 1)->findAll(),
---
SELECT *
FROM `packages`
WHERE `is_active` = 1