app/Controllers/Client/ProfileController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '9'

                // Create directory if not exists
                create_upload_directory('profile_pictures');

                $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '9'

        }

        try {
            if ($this->userModel->update($userId, $data)) {
                // Update session data if profile is updated
                $updatedUser = $this->userModel->find($userId);
---
UPDATE `users` SET `first_name` = 'amanta', `last_name` = '', `phone` = '', `address` = '', `profile_picture` = 'profile_pictures/1751371113_5272924d9643735295fd.jpg', `updated_at` = '2025-07-01 11:58:33'
WHERE `users`.`id` IN ('9')
SELECT *
FROM `users`
WHERE `users`.`id` = '9'