app/Controllers/Client/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
---
    public function update()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);