app/Controllers/Client/PsychotestController.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Psikotes',
            'tests' => $this->psychotestModel->where('is_active', 1)->findAll(),
---
SELECT *
FROM `psychotests`
WHERE `is_active` = 1