app/Controllers/Admin/ArticleManagementController.php

    public function adminArticleIndex()
    {
        $data = [
            'title' => 'Manajemen Artikel',
            'articles' => $this->articleModel->findAll(),
---
SELECT *
FROM `articles`