app/Controllers/Admin/AudioToneManagementController.php

SELECT *
FROM `audio_tones`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Audio Tone',
            'audioTones' => $this->audioToneModel->findAll(),