app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard Admin',
            'user'  => session()->get(),
            'totalUsers' => $this->userModel->countAllResults(),
            'totalTherapists' => $this->therapistModel->countAllResults(),
            'pendingTherapistVerifications' => $this->therapistModel->where('verification_status', 'pending')->countAllResults(),
            'totalArticles' => $this->articleModel->countAllResults(),
            'totalSupportTickets' => $this->supportTicketModel->countAllResults(),
            'pendingSupportTickets' => $this->supportTicketModel->where('status', 'open')->countAllResults(),
            'recentTherapistVerifications' => $this->therapistModel->orderBy('created_at', 'DESC')->findAll(5),
            'recentContent' => $this->articleModel->orderBy('created_at', 'DESC')->findAll(5),
            'recentSupportTickets' => $this->supportTicketModel->orderBy('created_at', 'DESC')->findAll(5),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `therapists`
SELECT COUNT(*) AS `numrows`
FROM `therapists`
WHERE `verification_status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `articles`
SELECT COUNT(*) AS `numrows`
FROM `support_tickets`
SELECT COUNT(*) AS `numrows`
FROM `support_tickets`
WHERE `status` = 'open'
SELECT *
FROM `therapists`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `articles`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `support_tickets`
ORDER BY `created_at` DESC
 LIMIT 5