app/Controllers/Admin/FAQManagementController.php

    public function index()
    {
        $data = [
            'title' => 'Manajemen FAQ',
            'faqs' => $this->faqModel->findAll(),
---
SELECT *
FROM `faqs`