app/Controllers/Admin/SupportTicketController.php

    public function index()
    {
        $data = [
            'title' => 'Manajemen Tiket Dukungan',
            'tickets' => $this->supportTicketModel->findAll(),
---
SELECT *
FROM `support_tickets`