app/Controllers/Admin/TherapistVerificationController.php

    public function index()
    {
        $data = [
            'title' => 'Verifikasi Terapis',
            'therapists' => $this->therapistModel->findAll(),
---
SELECT *
FROM `therapists`