app/Controllers/Admin/UserManagementController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Pengguna',
            'users' => $this->userModel->findAll(),