app/Controllers/Therapist/ArticleController.php

SELECT *
FROM `articles`
WHERE `author_id` = '5'
ORDER BY `created_at` DESC
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function therapistArticlesIndex()
    {
        $userId = session()->get('user_id');
        $data = [
            'title' => 'Manajemen Artikel',
            'articles' => $this->articleModel->where('author_id', $userId)->orderBy('created_at', 'DESC')->findAll(),
            'user' => $this->userModel->find($userId),