app/Controllers/Therapist/DashboardController.php

SELECT *
FROM `therapists`
WHERE `user_id` = '5'
 LIMIT 1
---
    public function index()
    {
        $userId = session()->get('user_id');
        $therapist = $this->therapistModel->where('user_id', $userId)->first();