app/Controllers/Therapist/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
SELECT *
FROM `therapists`
WHERE `user_id` = '5'
 LIMIT 1
---
    public function index()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
        $therapist = $this->therapistModel->where('user_id', $userId)->first();