app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'tugusamanta10@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        $user = $this->userModel->where('email', $email)->first();