app/Controllers/HomeController.php

    public function index(): string
    {
        $platformReviewModel = new PlatformReviewModel();
        $testimonials = $platformReviewModel->findAll(); // Mengambil semua ulasan platform
---
SELECT *
FROM `platform_reviews`