app/Models/PlatformReviewModel.php

    public function getReviewsWithUserDetails(int $limit = 3): array
    {
        return $this->select('platform_reviews.*, users.first_name, users.last_name, users.profile_picture')
                    ->join('users', 'users.id = platform_reviews.user_id')
                    ->where('platform_reviews.status', 'approved') // Assuming a status for approved reviews
                    ->orderBy('platform_reviews.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `platform_reviews`.*, `users`.`first_name`, `users`.`last_name`, `users`.`profile_picture`
FROM `platform_reviews`
JOIN `users` ON `users`.`id` = `platform_reviews`.`user_id`
WHERE `platform_reviews`.`status` = 'approved'
ORDER BY `platform_reviews`.`created_at` DESC
 LIMIT 3